RT-Thread/rt-thread/bsp/imxrt/imxrt1052-fire-pro/board/MCUX_Config/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_B0_12 (coord K14), UART1_TXD */
#define BOARD_INITPINS_UART1_TXD_PERIPHERAL                              LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INITPINS_UART1_TXD_SIGNAL                                       TX   /*!< LPUART1 signal: TX */

/* GPIO_AD_B0_13 (coord L14), UART1_RXD */
#define BOARD_INITPINS_UART1_RXD_PERIPHERAL                              LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INITPINS_UART1_RXD_SIGNAL                                       RX   /*!< LPUART1 signal: RX */

/* GPIO_AD_B1_02 (coord L11), SPDIF_OUT/J22[7] */
#define BOARD_INITPINS_SPDIF_OUT_PERIPHERAL                              LPUART2   /*!< Device name: LPUART2 */
#define BOARD_INITPINS_SPDIF_OUT_SIGNAL                                       TX   /*!< LPUART2 signal: TX */

/* GPIO_AD_B1_03 (coord M12), SPDIF_IN/J22[8] */
#define BOARD_INITPINS_SPDIF_IN_PERIPHERAL                               LPUART2   /*!< Device name: LPUART2 */
#define BOARD_INITPINS_SPDIF_IN_SIGNAL                                        RX   /*!< LPUART2 signal: RX */

/* GPIO_B1_12 (coord D13), SD_CD_SW */
#define BOARD_INITPINS_SD_CD_SW_PERIPHERAL                               LPUART5   /*!< Device name: LPUART5 */
#define BOARD_INITPINS_SD_CD_SW_SIGNAL                                        TX   /*!< LPUART5 signal: TX */

/* GPIO_B1_13 (coord D14), WDOG_B */
#define BOARD_INITPINS_WDOG_B_PERIPHERAL                                 LPUART5   /*!< Device name: LPUART5 */
#define BOARD_INITPINS_WDOG_B_SIGNAL                                          RX   /*!< LPUART5 signal: RX */

/* GPIO_AD_B1_08 (coord H13), AUD_INT/CSI_D9//J35[13]/J22[4] */
#define BOARD_INITPINS_CSI_D9_PERIPHERAL                                    PWM4   /*!< Device name: PWM4 */
#define BOARD_INITPINS_CSI_D9_SIGNAL                                           A   /*!< PWM4 signal: A */
#define BOARD_INITPINS_CSI_D9_CHANNEL                                         0U   /*!< PWM4 A channel: 0 */

/* GPIO_AD_B1_09 (coord M13), SAI1_MCLK/CSI_D8/J35[11] */
#define BOARD_INITPINS_CSI_D8_PERIPHERAL                                    PWM4   /*!< Device name: PWM4 */
#define BOARD_INITPINS_CSI_D8_SIGNAL                                           A   /*!< PWM4 signal: A */
#define BOARD_INITPINS_CSI_D8_CHANNEL                                         1U   /*!< PWM4 A channel: 1 */

/* GPIO_AD_B0_10 (coord G13), JTAG_TDO/J21[13]/INT1_COMBO/ENET_INT/J22[6]/U32[11] */
#define BOARD_INITPINS_INT1_COMBO_PERIPHERAL                                PWM1   /*!< Device name: PWM1 */
#define BOARD_INITPINS_INT1_COMBO_SIGNAL                                       A   /*!< PWM1 signal: A */
#define BOARD_INITPINS_INT1_COMBO_CHANNEL                                     3U   /*!< PWM1 A channel: 3 */

/* GPIO_AD_B1_10 (coord L13), BSP_RS485_RE */
#define BOARD_INITPINS_CSI_D7_GPIO                                         GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_CSI_D7_PORT                                         GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITPINS_CSI_D7_PIN                                            26U   /*!< GPIO1 pin index: 26 */

/* GPIO_AD_B1_11 (coord J13), BSP_DS18B20 */
#define BOARD_INITPINS_CSI_D6_GPIO                                         GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_CSI_D6_PORT                                         GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITPINS_CSI_D6_PIN                                            27U   /*!< GPIO1 pin index: 27 */

/* GPIO_AD_B1_05 (coord K12), BSP_AP3216C_INT */
#define BOARD_INITPINS_CSI_MCLK_GPIO                                       GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_CSI_MCLK_PORT                                       GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITPINS_CSI_MCLK_PIN                                          21U   /*!< GPIO1 pin index: 21 */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
